app/Controllers/Home.php

    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $model = new UserModel();
        $where = 'tbl_user.type LIKE "__y_"';
        $member = $model->select('tbl_user.user_id, tbl_user.namalengkap, tbl_datadiri.foto, tbl_datadiri.alamat, tbl_datadiri.notelp, tbl_datadiri.email, tbl_datadiri.bagidata, tbl_datadiri.keahlian, tbl_datadiri.tempatkerja, tbl_datadiri.alamatkerja, tbl_datadiri.telpkerja, tbl_datadiri.emailkerja, tbl_dpr.dpr_nama')->where('softdelete','Tidak')->where('status', 'aktif')->where($where)->join('tbl_datadiri', 'tbl_user.user_id=tbl_datadiri.user_id','left')->join('tbl_dpr', 'tbl_user.dpr_id=tbl_dpr.dpr_id','left')->orderby('tbl_user.user_id','RANDOM')->limit(9)->find();
---
SELECT `tbl_user`.`user_id`, `tbl_user`.`namalengkap`, `tbl_datadiri`.`foto`, `tbl_datadiri`.`alamat`, `tbl_datadiri`.`notelp`, `tbl_datadiri`.`email`, `tbl_datadiri`.`bagidata`, `tbl_datadiri`.`keahlian`, `tbl_datadiri`.`tempatkerja`, `tbl_datadiri`.`alamatkerja`, `tbl_datadiri`.`telpkerja`, `tbl_datadiri`.`emailkerja`, `tbl_dpr`.`dpr_nama`
FROM `tbl_user`
LEFT JOIN `tbl_datadiri` ON `tbl_user`.`user_id`=`tbl_datadiri`.`user_id`
LEFT JOIN `tbl_dpr` ON `tbl_user`.`dpr_id`=`tbl_dpr`.`dpr_id`
WHERE `softdelete` = 'Tidak'
AND `status` = 'aktif'
AND `tbl_user`.`type` LIKE "__y_"
ORDER BY RAND()
 LIMIT 9

    public function auth()
    {

        helper(['form']);
        $rules = [
            'email'     => 'required|valid_email',
            'password'     => 'required'
        ];

        if($this->validate($rules)){
            $session = session();
            $model = new UserModel();
            $username = $this->request->getVar('email');
            $password = $this->request->getVar('password');
            $data = $model->where('username', $username)->where('status','aktif')->where('softdelete','Tidak')->first();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'gdebig@gmail.com'
AND `status` = 'aktif'
AND `softdelete` = 'Tidak'
 LIMIT 1

    public function anggota()
    {
        $session = session();
        $user_id = $session->get('user_id');
        $logged_in = $session->get('logged_in');
        $role = $session->get('role');
        $dpr_id = $session->get('dpr_id');
        $model = new UserModel();
        $data['logged_in'] = $logged_in;
        $where = 'tbl_user.type LIKE "__y_"';
        $member = $model->select('tbl_user.user_id, tbl_user.kodeanggota, tbl_user.namalengkap, tbl_dpr.dpr_nama, tbl_datadiri.keahlian')->where('tbl_user.status','aktif')->where('tbl_user.softdelete', 'Tidak')->where($where)->join('tbl_dpr', 'tbl_user.dpr_id = tbl_dpr.dpr_id', 'left')->join('tbl_datadiri', 'tbl_user.user_id = tbl_datadiri.user_id', 'left')->orderby('tbl_user.user_id','DESC')->findall();
---
SELECT `tbl_user`.`user_id`, `tbl_user`.`kodeanggota`, `tbl_user`.`namalengkap`, `tbl_dpr`.`dpr_nama`, `tbl_datadiri`.`keahlian`
FROM `tbl_user`
LEFT JOIN `tbl_dpr` ON `tbl_user`.`dpr_id` = `tbl_dpr`.`dpr_id`
LEFT JOIN `tbl_datadiri` ON `tbl_user`.`user_id` = `tbl_datadiri`.`user_id`
WHERE `tbl_user`.`status` = 'aktif'
AND `tbl_user`.`softdelete` = 'Tidak'
AND `tbl_user`.`type` LIKE "__y_"
ORDER BY `tbl_user`.`user_id` DESC