app/Controllers/Home.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'gdebig@gmail.com'
AND `status` = 'aktif'
 LIMIT 1
---
    public function auth()
    {

        helper(['form']);
        $rules = [
            'email'     => 'required|valid_email',
            'password'     => 'required'
        ];

        if($this->validate($rules)){
            $session = session();
            $model = new UserModel();
            $username = $this->request->getVar('email');
            $password = $this->request->getVar('password');
            $data = $model->where('username', $username)->where('status','aktif')->first();