app/Controllers/Infodpr.php

    public function index()
    {
        $session = session();
        $user_id = $session->get('user_id');
        $logged_in = $session->get('logged_in');
        $role = $session->get('role');
        $dpr_id = $session->get('dpr_id');
        $model = new DprModel();
        $dpr = $model->where('dpr_id', $dpr_id)->first();
---
SELECT *
FROM `tbl_dpr`
WHERE `dpr_id` = '1'
 LIMIT 1

    public function ubahdpr($id){
        $session = session();
        $logged_in = $session->get('logged_in');
        $model = new DprModel();
        $dpr = $model->where('dpr_id', $id)->first();
---
SELECT *
FROM `tbl_dpr`
WHERE `dpr_id` = '1'
 LIMIT 1