app/Controllers/Mananggota.php

    public function index()
    {
        $session = session();
        $user_id = $session->get('user_id');
        $logged_in = $session->get('logged_in');
        $model = new UserModel();
        $data['logged_in'] = $logged_in;
        $member = $model->where('softdelete', 'Tidak')->orderby('user_id','DESC')->findall();
        if (!empty($member)){
            $data['info_member'] = $member;
        }else{
            $data['info_member'] = 'kosong';
        }
        $data['role'] = $session->get('role');
        $data['tipe_user'] = $session->get('tipe_user');
---
SELECT *
FROM `tbl_user`
WHERE `softdelete` = 'Tidak'
ORDER BY `user_id` DESC
SELECT *
FROM `tbl_user`
ORDER BY `user_id` DESC

    public function ubahmember($id){
        $session = session();
        $logged_in = $session->get('logged_in');
        $model = new UserModel();
        $member = $model->where('user_id', $id)->first();
---
SELECT *
FROM `tbl_user`
WHERE `user_id` = '4'
 LIMIT 1