app/Controllers/Mandpr.php

    public function ubahdpr($id){
        $session = session();
        $logged_in = $session->get('logged_in');
        $model = new DprModel();
        $org = $model->where('dpr_id', $id)->first();
---
SELECT *
FROM `tbl_dpr`
WHERE `dpr_id` = '7'
 LIMIT 1