app/Controllers/Superadmin.php

    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $user_id = $session->get('user_id');

        $model = new UserModel();
        $data['user_count'] = $model->where('softdelete','Tidak')->countAllResults();
        $where = "datecreated >= DATE_SUB(now(), INTERVAL 3 MONTH)";
        $data['last3months'] = $model->where($where)->where('softdelete','Tidak')->countAllResults();

        $model1 = new DprModel();
        $data['dpr_count'] = $model1->countAll();
        $where1 = "datediff(NOW(), tbl_dpr.expired)>=-180";
        $dpr = $model1->where($where1)->orderby('expired', 'ASC')->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`
WHERE `softdelete` = 'Tidak'
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`
WHERE `datecreated` >= DATE_SUB(now(), INTERVAL 3 MONTH)
AND `softdelete` = 'Tidak'
SELECT COUNT(*) AS `numrows` FROM `tbl_dpr`
SELECT *
FROM `tbl_dpr`
WHERE datediff(NOW(), tbl_dpr.expired) >= -180
ORDER BY `expired` ASC